app/controllers/countries_controller.rb

SELECT * FROM `countries` WHERE (name LIKE '%%')
---
  def index
    @countries = Country.find(:all)

SELECT * FROM `countries` WHERE (`countries`.`id` = 1)
---
  def show
    @country = Country.find(params[:id])

SELECT * FROM `countries` WHERE (`countries`.`id` = 1103)
---
  def edit
    @country = Country.find(params[:id])

INSERT INTO `countries` (`name`, `created_at`, `updated_at`) VALUES('Japan', '2011-06-12 05:49:40', '2011-06-12 05:49:40')
---
  def create
    @country = Country.new(params[:country])
    respond_to do |format|
      if @country.save

SELECT * FROM `countries` WHERE (`countries`.`id` = 298486374)
UPDATE `countries` SET `updated_at` = '2011-06-23 06:02:21', `name` = 'Japan' WHERE `id` = 298486374
---
  def update
    @country = Country.find(params[:id])

    respond_to do |format|
      if @country.update_attributes(params[:country])

SELECT * FROM `countries` WHERE (`countries`.`id` = 1103)
DELETE FROM `countries` WHERE `id` = 1103
---
  def destroy
    @country = Country.find(params[:id])
    @country.destroy