app/controllers/peoples_controller.rb

  def index
    @peoples = People.all
---
SELECT * FROM `peoples`

  def show
    @people = People.find(params[:id])
---
SELECT * FROM `peoples` WHERE (`peoples`.`id` = 1)

  def edit
    @people = People.find(params[:id])
---
SELECT * FROM `peoples` WHERE (`peoples`.`id` = 1)

  def create
    @people = People.new(params[:people])
    respond_to do |format|
      if @people.save
---
INSERT INTO `peoples` (`name`, `address`, `created_at`, `country`, `updated_at`) VALUES('Dhepthi', 'Pursaiwalkam', '2011-06-12 05:43:01', 'India', '2011-06-12 05:43:01')

  def update
    @people = People.find(params[:id])
---
SELECT * FROM `peoples` WHERE (`peoples`.`id` = 980190962)

  def save_markers
   @markers = Map.new(params[:markers])
   if @markers.save
---
INSERT INTO `maps` (`latitude`, `created_at`, `updated_at`, `longitude`, `marker_name`) VALUES(52.2111811126929, '2011-08-10 00:31:09', '2011-08-10 00:31:09', -85.88074, 'Marker 1')